var imya = prompt("Как Вас зовут?");

console.log(imya);

var age = +prompt("Сколько Вам лет?");

console.log(age);

var sum = +prompt("Хорошо. Найдите сумму чисел 77 и 89");

console.log("Ваш ответ 77 + 89 = " + sum);

console.log("Правильный ответ " + (77 + 89));

var ab = +prompt("Вычтите 60 из 40");

console.log("Ваш ответ 40 - 60 = " + ab);

console.log("Правильный ответ " + (40 - 60));

var mult = +prompt("Умножьте 77 на 2")

console.log("Ваш ответ 77 * 2 = " + mult);

console.log("Правильный ответ " + 77*2);

var divide = +prompt("Разделите 66 на 3");

console.log("Ваш ответ 66 / 3 = " + divide);

console.log("Правильный ответ " + 66 / 3);

var left = +prompt("Что будет в остатке при делении 100 на 3");

console.log("Ваш остаток при делении 100 / 3 = " + left);

console.log("А вот правильный ответ такой: " + 100 % 3);

alert("Всё, отмучились. Проверьте правильные ответы в консоли разработчика. Если знаете, где она.");





var x = +prompt("Задумайте любое число и введите тут");

console.log("Ваше первое число " + x);

var y = +prompt("Задумайте еще одно число");

console.log("Второе число " + y)

var z = +prompt("И третье число...");

console.log("Третье число " + z);

var sum2 = (x + y + z)/3;

console.log("Вычисляю, вычисляю...")

alert("Вы задумали числа " + x + " потом " + y + " и потом еще " + z + ". Поищем их среднее арифметическое. Нажмите ОК");

console.log("Среднее арифметическое того, что Вы задумали " + sum2)

alert("Среднее арифметическое будет " + sum2);



